Linearization.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Linearization</title>
<!-- 2014-09-25 Thu 21:20 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Paul Thompson" />
</head>
<body>
<div id="content">
<h1 class="title">Linearization</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Definition</a></li>
<li><a href="#sec-2">2. Overview</a></li>
<li><a href="#sec-3">3. Example</a></li>
<li><a href="#sec-4">4. Taylor Series</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Definition</h2>
<div class="outline-text-2" id="text-1">
<p>
Linearization is the process of taking equation(s) governing a
nonlinear system and approximating them as linear equations.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Overview</h2>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Example</h2>
<div class="outline-text-2" id="text-3">
<p>
The area of a circle is represented the equation
</p>
\begin{equation}
A = \pi*r^2
\end{equation}

<p>
We can represent the nonlinearity to a small change in area &delta;(A)
to a small change in radius &delta;(r) the following way:
</p>
\begin{equation}
A_0 + \delta(A) = \pi (r_0 + \delta(r))^2 = \pi (r_0^2 + 2 r_0
\delta(r) + \delta(r)^2)
\end{equation}

<p>
We can substract our normal area equation to show what &delta;(A)
depends on
</p>

\begin{equation}
\delta(A) = \pi (2 r_0 \delta(r) + \delta(r)^2)
\end{equation}

<p>
So we see that a small change in area is dependant on both a linear (2
r<sub>0</sub> &delta;(r)) term and a nonlinear (&delta;(r)<sup>2</sup>) term. Therefore, we
can linearize this equation by discarding the nonlinear term.
</p>

<p>
\begin{equation}
&delta;(A) = 2 &pi; r<sub>0</sub> &delta;(r)
</p>
<p>
\begin{equation}
</p>

<p>
We see from above that the accuracy of our approximation will then
depend on 1) the size of the change in r; and 2) the distance from
r<sub>0</sub>. For this reason, linearization is often refered to as being taken
"about a point" and the point that is selected can be critical.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Taylor Series</h2>
<div class="outline-text-2" id="text-4">
<p>
Note that the derivation above is equivalent to the expanded Taylor
series discarding the higher order terms.
</p>

\begin{align}
A(r) &= f(a) + f'(a)(r-a) + ... \\
&= f(r_0) + f'(r_0)(r-r_0) \\
&= \pi r_0^2 + 2 \pi r_0 (r-r_0) \\
&= \pi r_0^2 + 2 \pi r_0 r - 2 \pi r_0^2 \\
&= 2 \pi r_0 r - \pi r_0^2
\end{align}

<p>
If this was evaluated at r= r<sub>0</sub> + &delta;(r), we would have the same
result of above
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Paul Thompson</p>
<p class="date">Created: 2014-09-25 Thu 21:20</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.50.2 (<a href="http://orgmode.org">Org</a> mode 8.2.7c)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>